; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	infrared3 - mode
	thermograph0 - mode
	Star5 - direction
	GroundStation1 - direction
	Star3 - direction
	Star2 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star5)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star4)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 GroundStation6)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
)
(:goal (and
	(pointing satellite0 Star11)
	(pointing satellite2 Star3)
	(pointing satellite3 Star7)
	(pointing satellite4 Star4)
	(have_image Star7 infrared3)
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 thermograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 1 of 9
2. (calibrate satellite4 instrument7 star3)
   added: (calibrated instrument7)
   goals met: 1 of 9
3. (turn_to satellite4 star7 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 star7)
   goals met: 1 of 9
4. (take_image satellite4 star7 instrument7 infrared3)
   added: (have_image star7 infrared3)
   goals met: 2 of 9
5. (turn_to satellite4 planet8 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 planet8)
   goals met: 2 of 9
6. (take_image satellite4 planet8 instrument7 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 3 of 9
7. (turn_to satellite4 phenomenon10 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 9
8. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 4 of 9
9. (take_image satellite4 phenomenon10 instrument7 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 5 of 9
10. (switch_on instrument9 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument9)
   goals met: 5 of 9
11. (calibrate satellite5 instrument9 star4)
   added: (calibrated instrument9)
   goals met: 5 of 9
12. (turn_to satellite3 star7 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star7)
   goals met: 6 of 9
13. (turn_to satellite4 star4 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star4)
   goals met: 7 of 9
14. (turn_to satellite5 phenomenon9 star4)
   deleted: (pointing satellite5 star4)
   added: (pointing satellite5 phenomenon9)
   goals met: 7 of 9
15. (take_image satellite5 phenomenon9 instrument9 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 8 of 9
16. (turn_to satellite5 star11 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 star11)
   goals met: 8 of 9
17. (take_image satellite5 star11 instrument9 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 9 of 9
